### Home takedown challenge

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
dataframe_1 = pd.read_csv('takehome_user_engagement.csv')
dataframe_2 = pd.read_csv('takehome_users.csv',index_col='object_id',encoding = "ISO-8859-1")

In [4]:
dataframe_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 207917 entries, 0 to 207916
Data columns (total 3 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   time_stamp  207917 non-null  object
 1   user_id     207917 non-null  int64
 2   visited     207917 non-null  int64
dtypes: int64(2), object(1)
memory usage: 4.8+ MB

In [5]:
dataframe_1.time_stamp = pd.to_datetime(dataframe_1.time_stamp)

In [6]:
dataframe_1 = dataframe_1.set_index('time_stamp')

In [7]:
dataframe_1['Count'] = 1

In [8]:
dataframe_1.head()

                     user_id  visited  Count
time_stamp
2014-04-22 03:53:30        1        1      1
2013-11-15 03:45:04        2        1      1
2013-11-29 03:45:04        2        1      1
2013-12-09 03:45:04        2        1      1
2013-12-25 03:45:04        2        1      1

In [12]:
new_dataframe_1 = dataframe_1.groupby('user_id').resample('W-MON').sum()

In [11]:
new_dataframe_1

             user_id  visited  Count
time_stamp
2012-06-04    255121       41     41
2012-06-11    342220       66     66
2012-06-18    650564      106    106
2012-06-25    587291      105    105
2012-07-02    719045      127    127
...              ...      ...    ...
2014-05-12  27923534     4738   4738
2014-05-19  28649720     4851   4851
2014-05-26  27298386     4623   4623
2014-06-02  20615224     3485   3485
2014-06-09   4532847      772    772

[106 rows x 3 columns]